{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/tefannastasa/Library/Caches/pypoetry/virtualenvs/fii-advrn-project-h28zvCYG-py3.12/lib/python3.12/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    }
   ],
   "source": [
    "from transformers import AutoTokenizer, AutoModel\n",
    "import torch\n",
    "import psycopg2\n",
    "from tqdm import tqdm\n",
    "import json\n",
    "from psycopg2 import sql\n",
    "database = {\n",
    "    \"database\": \"postgres\",\n",
    "    \"user\": \"postgres\",\n",
    "    \"password\": \"password\",\n",
    "    \"host\": \"192.168.1.16\",\n",
    "    \"port\": \"5432\"\n",
    "}\n",
    "\n",
    "def connect_to_db():\n",
    "    return psycopg2.connect(\n",
    "        dbname=database[\"database\"],\n",
    "        user=database[\"user\"],\n",
    "        password=database[\"password\"],\n",
    "        host=database[\"host\"],\n",
    "        port=database[\"port\"]\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn = connect_to_db()\n",
    "conn.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from dataclasses import dataclass\n",
    "\n",
    "@dataclass\n",
    "class Subject:\n",
    "    code: str\n",
    "    name: str\n",
    "    classification_name: str\n",
    "    alternative_names: list[str]\n",
    "    related: list[str]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "# import json, urllib\n",
    "# from tqdm import tqdm\n",
    "# from psycopg2 import sql\n",
    "# with open(\"../llms4subjects/shared-task-datasets/GND/dataset/GND-Subjects-all.json\", \"r\") as gnd_subjects_file:\n",
    "#     gnd_subjects = json.load(gnd_subjects_file)\n",
    "\n",
    "# subjects = [\n",
    "#     Subject(\n",
    "#         code=subject[\"Code\"],\n",
    "#         name=urllib.parse.quote_plus(subject[\"Name\"]),\n",
    "#         classification_name=urllib.parse.quote_plus(subject[\"Classification Name\"]),\n",
    "#         alternative_names=[\n",
    "#             urllib.parse.quote_plus(alternative_name)\n",
    "#             for alternative_name in subject[\"Alternate Name\"]\n",
    "#         ],\n",
    "#         related=[\n",
    "#             urllib.parse.quote_plus(related)\n",
    "#             for related in subject[\"Related Subjects\"]\n",
    "#         ]\n",
    "#     )\n",
    "#     for subject in gnd_subjects\n",
    "# ]\n",
    "\n",
    "# conn = connect_to_db()\n",
    "# cursor = conn.cursor()\n",
    "# cursor.execute(\"SET search_path TO ag_catalog;\")\n",
    "# for subject in tqdm(subjects):\n",
    "#     query = sql.SQL(\"\"\"\n",
    "#         SELECT * FROM cypher('gnd', $$\n",
    "#             MATCH (s:Subject {{code: {code}}})\n",
    "#             SET s.name = {name}\n",
    "#             RETURN s.name\n",
    "#         $$) AS (s text);\n",
    "#     \"\"\").format(\n",
    "#         code=sql.Literal(subject.code),\n",
    "#         name=sql.Literal(subject.name)\n",
    "#     )\n",
    "#     cursor.execute(query)\n",
    "# conn.commit()\n",
    "# conn.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "def random_sample_documents(amount):\n",
    "    connection = connect_to_db()\n",
    "    cursor = connection.cursor()\n",
    "\n",
    "    cursor.execute(\n",
    "        f\"\"\"\n",
    "        SET search_path TO ag_catalog;\n",
    "        SELECT * FROM (\n",
    "                SELECT * FROM cypher('gnd', $$\n",
    "                MATCH (d:Document)-[:DOC_SUBJECT]->(s:Subject)\n",
    "                RETURN d\n",
    "            $$) AS (d agtype)\n",
    "        ) AS subquery\n",
    "        ORDER BY random()\n",
    "        LIMIT {amount};\n",
    "        \"\"\"\n",
    "    )\n",
    "    documents = [json.loads(a[0].replace(\"::vertex\", \"\")) for a in cursor.fetchall() ]\n",
    "    to_ret = []\n",
    "    for document in documents:\n",
    "        doc_id = document[\"id\"]\n",
    "        query = f\"\"\"\n",
    "        SELECT * FROM cypher('gnd', $$\n",
    "            MATCH (d:Document)-[:DOC_SUBJECT]->(s:Subject)\n",
    "            WHERE id(d) = {doc_id}\n",
    "            RETURN s\n",
    "        $$) AS (s agtype);\n",
    "        \"\"\"\n",
    "        cursor.execute(query)\n",
    "\n",
    "        related_subjects = [json.loads(a[0].replace(\"::vertex\", \"\")) for a in cursor.fetchall() ]\n",
    "        to_ret.append((document, related_subjects))\n",
    "\n",
    "    connection.close()\n",
    "    \n",
    "    return to_ret\n",
    "    \n",
    "docs = random_sample_documents(4)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 4/4 [00:00<00:00,  7.25it/s]\n"
     ]
    }
   ],
   "source": [
    "from typing import List\n",
    "SUBJ_SAMPLE_NR = 100\n",
    "\n",
    "def sample_random_subjects(sample_size: int):\n",
    "    to_ret = []\n",
    "    connection = connect_to_db()\n",
    "    cursor = connection.cursor()\n",
    "\n",
    "    cursor.execute(f\"\"\"\n",
    "        SET search_path TO ag_catalog;\n",
    "        SELECT * FROM\n",
    "        ( \n",
    "            SELECT * FROM cypher('gnd', $$\n",
    "                MATCH (s:Subject)\n",
    "                RETURN s\n",
    "            $$) AS (s agtype)\n",
    "        ) AS subquery\n",
    "        ORDER BY random()\n",
    "        LIMIT {sample_size}\n",
    "    \"\"\")\n",
    "    \n",
    "    subjects = [json.loads(a[0].replace(\"::vertex\", \"\")) for a in cursor.fetchall()]\n",
    "    \n",
    "    connection.close()\n",
    "\n",
    "    return subjects\n",
    "\n",
    "test_data = []\n",
    "for doc in tqdm(docs):\n",
    "    subj_to_sample = SUBJ_SAMPLE_NR - len(doc[1])\n",
    "    sample = sample_random_subjects(subj_to_sample)\n",
    "    sample.extend(doc[1])\n",
    "    test_data.append((doc, sample))\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "from torch import nn\n",
    "\n",
    "class FineTunedModel(nn.Module):\n",
    "    def __init__(self, base_model):\n",
    "        super(FineTunedModel, self).__init__()\n",
    "        self.base_model = base_model\n",
    "\n",
    "    def _mean_pooling(self, model_output, attention_mask):\n",
    "        token_embeddings = model_output[0] \n",
    "        input_mask_expanded = attention_mask.unsqueeze(-1).expand(token_embeddings.size()).float()\n",
    "        return torch.sum(token_embeddings * input_mask_expanded, 1) / torch.clamp(input_mask_expanded.sum(1), min=1e-9)\n",
    "\n",
    "\n",
    "    def forward(self, input_ids, attention_mask):\n",
    "        model_output = self.base_model(input_ids = input_ids, attention_mask=attention_mask)\n",
    "        sentence_embeddings = self._mean_pooling(model_output, attention_mask)\n",
    "\n",
    "        return sentence_embeddings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/jg/28vl91r97h34yywg7sj8sfdh0000gn/T/ipykernel_26064/1240126144.py:13: FutureWarning: You are using `torch.load` with `weights_only=False` (the current default value), which uses the default pickle module implicitly. It is possible to construct malicious pickle data which will execute arbitrary code during unpickling (See https://github.com/pytorch/pytorch/blob/main/SECURITY.md#untrusted-models for more details). In a future release, the default value for `weights_only` will be flipped to `True`. This limits the functions that could be executed during unpickling. Arbitrary objects will no longer be allowed to be loaded via this mode unless they are explicitly allowlisted by the user via `torch.serialization.add_safe_globals`. We recommend you start setting `weights_only=True` for any use case where you don't have full control of the loaded file. Please open an issue on GitHub for any issues related to this experimental feature.\n",
      "  model = torch.load(\"fine_tuned_model_complete.pth\")\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "FineTunedModel(\n",
       "  (base_model): BertModel(\n",
       "    (embeddings): BertEmbeddings(\n",
       "      (word_embeddings): Embedding(250037, 384, padding_idx=0)\n",
       "      (position_embeddings): Embedding(512, 384)\n",
       "      (token_type_embeddings): Embedding(2, 384)\n",
       "      (LayerNorm): LayerNorm((384,), eps=1e-12, elementwise_affine=True)\n",
       "      (dropout): Dropout(p=0.1, inplace=False)\n",
       "    )\n",
       "    (encoder): BertEncoder(\n",
       "      (layer): ModuleList(\n",
       "        (0-11): 12 x BertLayer(\n",
       "          (attention): BertAttention(\n",
       "            (self): BertSdpaSelfAttention(\n",
       "              (query): Linear(in_features=384, out_features=384, bias=True)\n",
       "              (key): Linear(in_features=384, out_features=384, bias=True)\n",
       "              (value): Linear(in_features=384, out_features=384, bias=True)\n",
       "              (dropout): Dropout(p=0.1, inplace=False)\n",
       "            )\n",
       "            (output): BertSelfOutput(\n",
       "              (dense): Linear(in_features=384, out_features=384, bias=True)\n",
       "              (LayerNorm): LayerNorm((384,), eps=1e-12, elementwise_affine=True)\n",
       "              (dropout): Dropout(p=0.1, inplace=False)\n",
       "            )\n",
       "          )\n",
       "          (intermediate): BertIntermediate(\n",
       "            (dense): Linear(in_features=384, out_features=1536, bias=True)\n",
       "            (intermediate_act_fn): GELUActivation()\n",
       "          )\n",
       "          (output): BertOutput(\n",
       "            (dense): Linear(in_features=1536, out_features=384, bias=True)\n",
       "            (LayerNorm): LayerNorm((384,), eps=1e-12, elementwise_affine=True)\n",
       "            (dropout): Dropout(p=0.1, inplace=False)\n",
       "          )\n",
       "        )\n",
       "      )\n",
       "    )\n",
       "    (pooler): BertPooler(\n",
       "      (dense): Linear(in_features=384, out_features=384, bias=True)\n",
       "      (activation): Tanh()\n",
       "    )\n",
       "  )\n",
       ")"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from transformers import AutoTokenizer, AutoModel\n",
    "import torch\n",
    "import base64\n",
    "\n",
    "\n",
    "def mean_pooling(model_output, attention_mask):\n",
    "    token_embeddings = model_output[0] \n",
    "    input_mask_expanded = attention_mask.unsqueeze(-1).expand(token_embeddings.size()).float()\n",
    "    return torch.sum(token_embeddings * input_mask_expanded, 1) / torch.clamp(input_mask_expanded.sum(1), min=1e-9)\n",
    "\n",
    "\n",
    "tokenizer = AutoTokenizer.from_pretrained('sentence-transformers/paraphrase-multilingual-MiniLM-L12-v2')\n",
    "model = torch.load(\"fine_tuned_model_complete.pth\")\n",
    "model.eval()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 50/50 [00:08<00:00,  5.85it/s]\n",
      "100%|██████████| 50/50 [18:08<00:00, 21.76s/it]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Precision of the sentence transformer over first 5 matches: 39.22\n",
      "Precision of the sentence transformer over first 20 matches: 68.34\n",
      "Precision of the sentence transformer over first 100 matches: 90.24\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "import torch.nn.functional as F\n",
    "import pandas as pd\n",
    "import matplotlib.pyplot as plt\n",
    "import seaborn as sns\n",
    "\n",
    "import math\n",
    "import seaborn as sns\n",
    "import matplotlib.pyplot as plt\n",
    "import pandas as pd\n",
    "import torch\n",
    "from datetime import datetime\n",
    "import urllib\n",
    "\n",
    "def compute_similarity(base, targets):\n",
    "    to_ret = []\n",
    "    for target in targets:\n",
    "        to_ret.append(F.cosine_similarity(base, target, dim=0))\n",
    "\n",
    "    return to_ret\n",
    "\n",
    "new_docs = random_sample_documents(50)\n",
    "\n",
    "SUBJ_SAMPLE_NR = 500\n",
    "test_data = []\n",
    "for doc in tqdm(new_docs):\n",
    "    subj_to_sample = SUBJ_SAMPLE_NR - len(doc[1])\n",
    "    sample = sample_random_subjects(subj_to_sample)\n",
    "    sample.extend(doc[1])\n",
    "    test_data.append((doc, sample))\n",
    "\n",
    "pos_thresh1 = 20\n",
    "pos_thresh2 = 5\n",
    "pos_thresh3 = 100\n",
    "final5 = 0\n",
    "final20 = 0\n",
    "final100 = 0\n",
    "for sample in tqdm(test_data):\n",
    "    document = sample[0][0]\n",
    "    document_title = urllib.parse.unquote(document['properties']['title']) + \" \" + urllib.parse.unquote(document['properties']['content'])\n",
    "    all_sentences = [urllib.parse.unquote(a['properties']['name']) + \" \" + urllib.parse.unquote(a['properties']['classification_name']) for a in sample[1]]\n",
    "    actual_related = [urllib.parse.unquote(a['properties']['name']) + \" \" + urllib.parse.unquote(a['properties']['classification_name']) for a in sample[0][1]]\n",
    "    all_sentences.insert(0, document_title)\n",
    "    tokenized_sentences = tokenizer(all_sentences, padding=True, truncation=True, return_tensors='pt')\n",
    "    token_ids = tokenized_sentences[\"input_ids\"]\n",
    "    att_mask  = tokenized_sentences[\"attention_mask\"]\n",
    "    with torch.no_grad():\n",
    "        embeddings = model(token_ids, att_mask)\n",
    "    \n",
    "    # embeddings = mean_pooling(model_output, tokenized_sentences['attention_mask'])\n",
    "    \n",
    "    similarity_scores = [(i, a) for i,a in enumerate(compute_similarity(embeddings[0], embeddings[1:]))]\n",
    "    similarity_scores.sort(key= lambda x: x[1], reverse=True)\n",
    "    top_scored = [a[0] for a in similarity_scores]\n",
    "    top_scored = [all_sentences[i+1] for i in top_scored]\n",
    "    \n",
    "    count_actuals100 = 0\n",
    "    count_actuals20 = 0\n",
    "    count_actuals5  = 0\n",
    "\n",
    "    for actual in actual_related:\n",
    "        count_actuals20 += 1 if actual in top_scored[:pos_thresh1] else 0\n",
    "        count_actuals5 += 1 if actual in top_scored[:pos_thresh2] else 0\n",
    "        count_actuals100 += 1 if actual in top_scored[:pos_thresh3] else 0\n",
    "    \n",
    "    count_actuals5 = round(count_actuals5/len(actual_related)*100 , 2)\n",
    "    count_actuals20 = round(count_actuals20/len(actual_related)*100 , 2)\n",
    "    count_actuals100 = round(count_actuals100/len(actual_related)*100 , 2)\n",
    "    \n",
    "    final5 += count_actuals5\n",
    "    final20 += count_actuals20\n",
    "    final100 += count_actuals100\n",
    "\n",
    "print(f\"Precision of the sentence transformer over first 5 matches: {final5/len(test_data):.2f}\")\n",
    "print(f\"Precision of the sentence transformer over first 20 matches: {final20/len(test_data):.2f}\")\n",
    "print(f\"Precision of the sentence transformer over first 100 matches: {final100/len(test_data):.2f}\")\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Current computed accuracy: 21.22: 100%|██████████| 1000/1000 [02:59<00:00,  5.58it/s]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Actual subjects accuracy in top 100 closest in the dataset: 21.22\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "import urllib\n",
    "def grab_top_embeddings(doc_emb, n):\n",
    "\n",
    "    conn = connect_to_db()\n",
    "    cursor = conn.cursor()\n",
    "\n",
    "    query = f\"\"\"\n",
    "        SELECT label_code\n",
    "        FROM label_embeddings\n",
    "        ORDER BY embedding <=> '{doc_emb}'::vector\n",
    "        LIMIT {n};\n",
    "    \"\"\"\n",
    "\n",
    "    cursor.execute(query)\n",
    "    top_labels = cursor.fetchall()\n",
    "\n",
    "    cursor.close()\n",
    "    conn.close()\n",
    "\n",
    "    return [a[0] for a in top_labels]\n",
    "\n",
    "new_docs = random_sample_documents(1000)\n",
    "with tqdm(new_docs, desc=\"Starting..\") as pbar:\n",
    "    overall_acc = 0\n",
    "    for i,doc in enumerate(new_docs):\n",
    "        document = doc[0]\n",
    "        related_subjects = [a['properties']['code'] for a in doc[1]]\n",
    "        document_content = urllib.parse.unquote(document['properties']['title']) + \" \" + urllib.parse.unquote(document['properties']['content'])\n",
    "        tokenized_text = tokenizer([document_content], padding=True, truncation=True, return_tensors='pt')\n",
    "        token_ids = tokenized_text[\"input_ids\"]\n",
    "        att_mask = tokenized_text[\"attention_mask\"]\n",
    "        with torch.no_grad():\n",
    "            embeddings = model(token_ids, att_mask)\n",
    "        \n",
    "        emb_vector = embeddings.cpu().numpy().flatten()\n",
    "        embedding_list = emb_vector.tolist()\n",
    "        embedding_str = '[' + ','.join(map(str, embedding_list)) + ']'\n",
    "\n",
    "        top_embeddings = grab_top_embeddings(embedding_str, 100)\n",
    "        doc_acc = 0\n",
    "        for subject_code in related_subjects:\n",
    "            doc_acc += 1 if subject_code in top_embeddings else 0\n",
    "        \n",
    "        doc_acc = round(doc_acc/len(related_subjects) * 100, 2)\n",
    "        overall_acc += doc_acc\n",
    "\n",
    "        pbar.set_description(f\"Current computed accuracy: {overall_acc / (i+1):.2f}\")\n",
    "        pbar.update()\n",
    "        \n",
    "    print(f\"Actual subjects accuracy in top 100 closest in the dataset: {overall_acc/len(new_docs):.2f}\")\n",
    "        "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "fii-advrn-project-h28zvCYG-py3.12",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
